export const API_URL = {
  LOGIN: '/api/login',
  LOGOUT: '/api/logout',
  GET_ACCOUNT_LIST: '/api/accounts',
} as const;

export const ACCESS_TOKEN = 'accessToken';

export const NAVIGATE_URL = {
  MAIN: '/',
  LOGIN: '/login',
} as const;

export const ACCOUNT_STATUS = {
  '9999': '관리자확인필요',
  '1': '입금대기',
  '2': '운용중',
  '3': '투자중지',
  '4': '해지',
} as const;

export const BROKERS = {
  '209': '유안타증권',
  '218': '현대증권',
  '230': '미래에셋증권',
  '238': '대우증권',
  '240': '삼성증권',
  '243': '한국투자증권',
  '247': '우리투자증권',
  '261': '교보증권',
  '262': '하이투자증권',
  '263': 'HMC투자증권',
  '264': '키움증권',
  '265': '이베스트투자증권',
  '266': 'SK증권',
  '267': '대신증권',
  '268': '아이엠투자증권',
  '269': '한화투자증권',
  '270': '하나대투자증권',
  '279': '동부증권',
  '280': '유진투자증권',
  '288': '카카오페이증권',
  '287': '메리츠종합금융증권',
  '290': '부국증권',
  '291': '신영증권',
  '292': 'LIG투자증권',
  '271': '토스증권',
} as const;

export const BROKER_FORMAT = {
  '209': '00-00000000-00',
  '218': '00-0000000-000',
  '230': '00-000000-0000',
  '238': '00-000-0000-000',
  '240': '00-0000-000000',
  '243': '00-000000000-0',
  '247': '00-0000-000000',
  '261': '00-00-00000000',
  '262': '00-0000000-000',
  '263': '00-0000-000000',
  '264': '00-0000-00-0000',
  '265': '00-000-000-0000',
  '266': '00-00000-00000',
  '267': '00-000-0000000',
  '268': '00-000000-00-00',
  '269': '00-00000-00000',
  '270': '00-000-0000000',
  '279': '00-00000-00000',
  '280': '00-0000-000000',
  '288': '00-00000000-00',
  '287': '00-0000-00000-0',
  '290': '00-000000-0000',
  '291': '00-0000-000000',
  '292': '00-00000-00000',
  '271': '00-000-0000000',
} as const;

export const formatMap = new Map([
  [209, ['([0-9|*]{2})([0-9|*]{8})([0-9|*]{2})', '$1-$2-$3']],
  [218, ['([0-9|*]{2})([0-9|*]{7})([0-9|*]{3})', '$1-$2-$3']],
  [230, ['([0-9|*]{2})([0-9|*]{6})([0-9|*]{4})', '$1-$2-$3']],
  [238, ['([0-9|*]{2})([0-9|*]{3})([0-9|*]{4})([0-9|*]{3})', '$1-$2-$3-$4']],
  [240, ['([0-9|*]{2})([0-9|*]{4})([0-9|*]{6})', '$1-$2-$3']],
  [243, ['([0-9|*]{2})([0-9|*]{9})([0-9|*]{1})', '$1-$2-$3']],
  [247, ['([0-9|*]{2})([0-9|*]{4})([0-9|*]{6})', '$1-$2-$3']],
  [261, ['([0-9|*]{2})([0-9|*]{2})([0-9|*]{8})', '$1-$2-$3']],
  [262, ['([0-9|*]{2})([0-9|*]{7})([0-9|*]{3})', '$1-$2-$3']],
  [263, ['([0-9|*]{2})([0-9|*]{4})([0-9|*]{6})', '$1-$2-$3']],
  [264, ['([0-9|*]{2})([0-9|*]{4})([0-9|*]{2})([0-9|*]{4})', '$1-$2-$3-$4']],
  [265, ['([0-9|*]{2})([0-9|*]{3})([0-9|*]{3})([0-9|*]{4})', '$1-$2-$3-$4']],
  [266, ['([0-9|*]{2})([0-9|*]{5})([0-9|*]{5})', '$1-$2-$3']],
  [267, ['([0-9|*]{2})([0-9|*]{3})([0-9|*]{7})', '$1-$2-$3']],
  [268, ['([0-9|*]{2})([0-9|*]{6})([0-9|*]{2})([0-9|*]{2})', '$1-$2-$3-$4']],
  [269, ['([0-9|*]{2})([0-9|*]{5})([0-9|*]{5})', '$1-$2-$3']],
  [270, ['([0-9|*]{2})([0-9|*]{3})([0-9|*]{7})', '$1-$2-$3']],
  [279, ['([0-9|*]{2})([0-9|*]{5})([0-9|*]{5})', '$1-$2-$3']],
  [280, ['([0-9|*]{2})([0-9|*]{4})([0-9|*]{6})', '$1-$2-$3']],
  [288, ['([0-9|*]{2})([0-9|*]{8})([0-9|*]{2})', '$1-$2-$3']],
  [287, ['([0-9|*]{2})([0-9|*]{4})([0-9|*]{5})([0-9|*]{1})', '$1-$2-$3-$4']],
  [290, ['([0-9|*]{2})([0-9|*]{6})([0-9|*]{4})', '$1-$2-$3']],
  [291, ['([0-9|*]{2})([0-9|*]{4})([0-9|*]{6})', '$1-$2-$3']],
  [292, ['([0-9|*]{2})([0-9|*]{5})([0-9|*]{5})', '$1-$2-$3']],
  [271, ['([0-9|*]{2})([0-9|*]{3})([0-9|*]{7})', '$1-$2-$3']],
]);

export function convertNumberFormat(key: number, accountNumber: string) {
  const content = formatMap.get(key);
  if (content) {
    const [reg, expression] = content;
    const regex = new RegExp(reg);
    return accountNumber.replace(regex, expression);
  }
  console.log(key, accountNumber, content, formatMap);
  return accountNumber;
}

export const SIDER = [
  { id: 1, name: '대시보드', keyword: 'dashboard' },
  { id: 2, name: '계좌 목록', keyword: 'accounts' },
  { id: 3, name: '사용자 목록', keyword: 'users' },
  { id: 9999, name: '로그아웃', keyword: 'logout' },
] as const;

export const ACCOUNT_COLUMN = [
  '고객명',
  '증권사',
  '계좌번호',
  '계좌상태',
  '계좌명',
  '평가금액',
  '입금금액',
  '계좌활성여부',
  '계좌개설일',
] as const;

export const DEFAULT_SEO = {
  title: '알티모빌리티 - 차량대여 서비스',
  description: '세상과 사람, 자동차의 교집합',
  canonical: 'http://www.raidea.io',
  openGraph: {
    type: 'website',
    locale: 'ko_KR',
    url: 'http://www.raidea.io',
    title: '알티모빌리티 - 차량대여 서비스',
    site_name: '알티모빌리티 - 차량대여 서비스',
    images: [
      {
        url: 'https://static.wanted.co.kr/images/wdes/0_4.1efa9680.png',
        width: 1200,
        height: 630,
        alt: 'image',
      },
    ],
  },
} as const;

export type ApiUrlType = typeof API_URL[keyof typeof API_URL];
export type BrokersFormatType =
  typeof BROKER_FORMAT[keyof typeof BROKER_FORMAT];
export type BrokerType = typeof BROKERS[keyof typeof BROKERS];
export type AccountStatus = typeof ACCOUNT_STATUS[keyof typeof ACCOUNT_STATUS];
